Autodesk.Revit.UI.MacroManagerUIData.GetApplication
Returns the Application.

Autodesk.Revit.UI.MacroManagerUIData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.MacroManagerUIData.#ctor(Autodesk.Revit.ApplicationServices.Application)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.MacroManagerUIData
Macro Manager UI data wrapper.

Autodesk.Revit.UI.MacroManagerUIData.#ctor(Autodesk.Revit.ApplicationServices.ControlledApplication)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null